feijie825/gonghao/boot_loader/LM3S21xx_sysctl.c
    if(!(ulConfig & SYSCTL_RCC_BYPASS))         //判断PLL是否旁路
     {                                          //使用PLL
      for(ulDelay = 32768; ulDelay > 0; ulDelay--)
       {
        if(SYSCTL->RIS & SYSCTL_INT_PLL_LOCK)
         break;               //锁相环锁定 跳出循环
       }
      ulRCC &= ~(SYSCTL_RCC_BYPASS);
      ulRCC2 &= ~(SYSCTL_RCC2_BYPASS2);
     }
    SYSCTL->RCC = ulRCC;
    SYSCTL->RCC2 = ulRCC2;
    SysCtlDelay(16);
}
/*****************************************************************************
* 获取系统时钟频率 
* 返回系统时钟频率
*****************************************************************************/
u32	SysCtlClockGet(void)
{
    u32 ulRCC, ulRCC2, ulPLL, ulClk;
    ulRCC = SYSCTL->RCC;
    ulRCC2 = SYSCTL->RCC2;
    switch((ulRCC2 & SYSCTL_RCC2_USERCC2) ?
           (ulRCC2 & SYSCTL_RCC2_OSCSRC2_M) :
           (ulRCC & SYSCTL_RCC_OSCSRC_M))
    {
        case SYSCTL_RCC_OSCSRC_MAIN:
         {
          ulClk = g_pulXtals[(ulRCC & SYSCTL_RCC_XTAL_M) >>
                             SYSCTL_RCC_XTAL_S];
          break;
         }
        case SYSCTL_RCC_OSCSRC_INT:
         {
          if(CLASS_IS_SANDSTORM)
           ulClk = 15000000;
          else
           ulClk = 12000000;
          break;
         }
        case SYSCTL_RCC_OSCSRC_INT4:
         {
          if(CLASS_IS_SANDSTORM)
           ulClk = 15000000 / 4;
          else
           ulClk = 12000000 / 4;
          break;
         }
        case SYSCTL_RCC_OSCSRC_30:
         {
          ulClk = 30000;
          break;
         }
        case SYSCTL_RCC2_OSCSRC2_32:
         {
          ulClk = 32768;
          break;
         }
        default:
         return(0);
     }
    if(((ulRCC2 & SYSCTL_RCC2_USERCC2) && !(ulRCC2 & SYSCTL_RCC2_BYPASS2)) ||
       (!(ulRCC2 & SYSCTL_RCC2_USERCC2) && !(ulRCC & SYSCTL_RCC_BYPASS)))
     {
      ulPLL = SYSCTL->PLLCFG;
      if(CLASS_IS_SANDSTORM)
       ulClk = ((ulClk * (((ulPLL & SYSCTL_PLLCFG_F_M) >>
                           SYSCTL_PLLCFG_F_S) + 2)) /
                (((ulPLL & SYSCTL_PLLCFG_R_M) >>
                  SYSCTL_PLLCFG_R_S) + 2));
      else
       ulClk = ((ulClk * ((ulPLL & SYSCTL_PLLCFG_F_M) >>
                          SYSCTL_PLLCFG_F_S)) /
                ((((ulPLL & SYSCTL_PLLCFG_R_M) >>
                   SYSCTL_PLLCFG_R_S) + 1) * 2));
      if(ulPLL & SYSCTL_PLLCFG_OD_2)
       ulClk /= 2;
      if(ulPLL & SYSCTL_PLLCFG_OD_4)
       ulClk /= 4;
     }
    if(ulRCC & SYSCTL_RCC_USESYSDIV)
     {
      if(ulRCC2 & SYSCTL_RCC2_USERCC2)
       ulClk /= (((ulRCC2 & SYSCTL_RCC2_SYSDIV2_M) >>
                  SYSCTL_RCC2_SYSDIV2_S) + 1);
      else
       ulClk /= (((ulRCC & SYSCTL_RCC_SYSDIV_M) >> SYSCTL_RCC_SYSDIV_S) +
                 1);
     }
    return(ulClk);
}
/*****************************************************************************
* 设置PWM系统时钟频率 
*****************************************************************************/
void SysCtlPWMClockSet(u32 ulConfig)
{
    ASSERT((ulConfig == SYSCTL_PWMDIV_1) ||
           (ulConfig == SYSCTL_PWMDIV_2) ||
           (ulConfig == SYSCTL_PWMDIV_4) ||
           (ulConfig == SYSCTL_PWMDIV_8) ||
           (ulConfig == SYSCTL_PWMDIV_16) ||
           (ulConfig == SYSCTL_PWMDIV_32) ||
           (ulConfig == SYSCTL_PWMDIV_64));
    ASSERT(SYSCTL->DC[1] & SYSCTL_DC1_PWM);
    SYSCTL->RCC = ((SYSCTL->RCC &
                          ~(SYSCTL_RCC_USEPWMDIV | SYSCTL_RCC_PWMDIV_M)) |
                         ulConfig);
}
/*****************************************************************************
* 获取PWM系统时钟频率 
*****************************************************************************/
u32	SysCtlPWMClockGet(void)
{
    ASSERT(SYSCTL->DC[1] & SYSCTL_DC1_PWM);
    if(!(SYSCTL->RCC & SYSCTL_RCC_USEPWMDIV))
     return(SYSCTL_PWMDIV_1);
    else
     return(SYSCTL->RCC &
            (SYSCTL_RCC_USEPWMDIV | SYSCTL_RCC_PWMDIV_M));
}
/*****************************************************************************
* 设置ADC采样速率 
*****************************************************************************/
void SysCtlADCSpeedSet(u32 ulSpeed)
{
    ASSERT((ulSpeed == SYSCTL_ADCSPEED_1MSPS) ||
           (ulSpeed == SYSCTL_ADCSPEED_500KSPS) ||
           (ulSpeed == SYSCTL_ADCSPEED_250KSPS) ||
           (ulSpeed == SYSCTL_ADCSPEED_125KSPS));
    ASSERT(SYSCTL->DC[1] & SYSCTL_DC1_ADC);
    SYSCTL->RCGC[0] = ((SYSCTL->RCGC[0] & ~(SYSCTL_RCGC0_ADCSPD_M)) |
                           ulSpeed);
    SYSCTL->SCGC[0] = ((SYSCTL->SCGC[0] & ~(SYSCTL_SCGC0_ADCSPD_M)) |
                           ulSpeed);
    SYSCTL->DCGC[0] = ((SYSCTL->DCGC[0] & ~(SYSCTL_DCGC0_ADCSPD_M)) |
                           ulSpeed);
}
/*****************************************************************************
* 获取ADC采样频率设置 
*****************************************************************************/
u32	SysCtlADCSpeedGet(void)
{
    ASSERT(SYSCTL->DC[1] & SYSCTL_DC1_ADC);
    return(SYSCTL->RCGC[0] & SYSCTL_RCGC0_ADCSPD_M);
}
/*****************************************************************************
* 内部振荡器校准设置
* bEnable=TRUE  校准
* bEnable=FALSE 不校准
*****************************************************************************/
void SysCtlIOSCVerificationSet(u8 bEnable)
{
    if(bEnable)
     SYSCTL->RCC |= SYSCTL_RCC_IOSCVER;
    else
     SYSCTL->RCC &= ~(SYSCTL_RCC_IOSCVER);
}
/*****************************************************************************
* 主振荡器校准设置
* bEnable=TRUE  校准
* bEnable=FALSE 不校准
*****************************************************************************/
void SysCtlMOSCVerificationSet(u8 bEnable)
{
    if(bEnable)
     SYSCTL->RCC |= SYSCTL_RCC_MOSCVER;
    else
     SYSCTL->RCC &= ~(SYSCTL_RCC_MOSCVER);
}
/*****************************************************************************
* PLL校准设置
* bEnable=TRUE  校准
* bEnable=FALSE 不校准
*****************************************************************************/
void SysCtlPLLVerificationSet(u8 bEnable)
{
    if(bEnable)
     SYSCTL->RCC |= SYSCTL_RCC_PLLVER;
    else
     SYSCTL->RCC &= ~(SYSCTL_RCC_PLLVER);
}
/*****************************************************************************
* 清除时钟校准
*****************************************************************************/
void SysCtlClkVerificationClear(void)
{
    SYSCTL->CLKVCLR = SYSCTL_CLKVCLR_VERCLR;
    SYSCTL->CLKVCLR = 0;
}
/*****************************************************************************
* GPIO AHB访问使能
*****************************************************************************/
void SysCtlGPIOAHBEnable(u32 ulGPIOPeripheral)
{
    ASSERT((ulGPIOPeripheral == SYSCTL_PERIPH_GPIOA) ||
           (ulGPIOPeripheral == SYSCTL_PERIPH_GPIOB) ||
           (ulGPIOPeripheral == SYSCTL_PERIPH_GPIOC) ||
           (ulGPIOPeripheral == SYSCTL_PERIPH_GPIOD) ||
           (ulGPIOPeripheral == SYSCTL_PERIPH_GPIOE) ||
           (ulGPIOPeripheral == SYSCTL_PERIPH_GPIOF) ||
           (ulGPIOPeripheral == SYSCTL_PERIPH_GPIOG) ||
           (ulGPIOPeripheral == SYSCTL_PERIPH_GPIOH));
    SYSCTL->GPIOHSCTL |= (ulGPIOPeripheral & 0xFFFF);
}
